Report/SpectrumAPIFrameWorkV3/SpectrumAPIFrameWork/Result/10-Oct-2018/10-Oct-2018_18-21-57/Logs.log

10-10-2018 18:22:03 INFO [driverTest]: Starting execution at +:10-Oct-2018 18:21:57
10-10-2018 18:23:07 INFO [driverTest]: ****************************************************************************************
10-10-2018 18:23:07 INFO [driverTest]: ****************************************************************************************
10-10-2018 18:23:07 INFO [driverTest]: $$$$$$$$$$$$$$$$$$$$$ TC_001 $$$$$$$$$$$$$$$$$$$$$$$$$
10-10-2018 18:23:07 INFO [driverTest]: ****************************************************************************************
10-10-2018 18:23:07 INFO [driverTest]: ****************************************************************************************
10-10-2018 18:23:07 INFO [driverTest]: request Fired +:<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">  <soap:Body>    <Add xmlns="http://tempuri.org/">      <intA>3</intA>      <intB>3</intB>    </Add>  </soap:Body></soap:Envelope>
10-10-2018 18:23:15 INFO [driverTest]: Response Code  :200
10-10-2018 18:23:15 INFO [driverTest]: Response Header  :Cache-Control=private, max-age=0
Content-Type=text/xml; charset=utf-8
Content-Encoding=gzip
Vary=Accept-Encoding
Server=Microsoft-IIS/7.5
X-AspNet-Version=2.0.50727
X-Powered-By=ASP.NET
Date=Wed, 10 Oct 2018 12:53:06 GMT
Content-Length=297
10-10-2018 18:23:15 INFO [driverTest]: Response   :<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><AddResponse xmlns="http://tempuri.org/"><AddResult>6</AddResult></AddResponse></soap:Body></soap:Envelope>
10-10-2018 18:23:31 INFO [driverTest]: XXXXXXXXXXXXXXXXXXXXXXX             -E---N---D-             XXXXXXXXXXXXXXXXXXXXXX
10-10-2018 18:23:31 INFO [driverTest]: ****************************************************************************************
10-10-2018 18:23:31 INFO [driverTest]: ****************************************************************************************
10-10-2018 18:23:31 INFO [driverTest]: $$$$$$$$$$$$$$$$$$$$$ TC_002 $$$$$$$$$$$$$$$$$$$$$$$$$
10-10-2018 18:23:31 INFO [driverTest]: ****************************************************************************************
10-10-2018 18:23:31 INFO [driverTest]: ****************************************************************************************
10-10-2018 18:23:33 INFO [driverTest]: request Fired +:<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">  <soap:Body>    <Divide xmlns="http://tempuri.org/">      <intA>6</intA>      <intB>3</intB>    </Divide>  </soap:Body></soap:Envelope>
10-10-2018 18:23:34 INFO [driverTest]: Response Code  :200
10-10-2018 18:23:34 INFO [driverTest]: Response Header  :Cache-Control=private, max-age=0
Content-Type=text/xml; charset=utf-8
Content-Encoding=gzip
Vary=Accept-Encoding
Server=Microsoft-IIS/7.5
X-AspNet-Version=2.0.50727
X-Powered-By=ASP.NET
Date=Wed, 10 Oct 2018 12:53:25 GMT
Content-Length=300
10-10-2018 18:23:34 INFO [driverTest]: Response   :<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><DivideResponse xmlns="http://tempuri.org/"><DivideResult>2</DivideResult></DivideResponse></soap:Body></soap:Envelope>
10-10-2018 18:23:50 INFO [driverTest]: XXXXXXXXXXXXXXXXXXXXXXX             -E---N---D-             XXXXXXXXXXXXXXXXXXXXXX
10-10-2018 18:23:50 INFO [driverTest]: ****************************************************************************************
10-10-2018 18:23:50 INFO [driverTest]: ****************************************************************************************
10-10-2018 18:23:50 INFO [driverTest]: $$$$$$$$$$$$$$$$$$$$$ TC_003 $$$$$$$$$$$$$$$$$$$$$$$$$
10-10-2018 18:23:50 INFO [driverTest]: ****************************************************************************************
10-10-2018 18:23:50 INFO [driverTest]: ****************************************************************************************
10-10-2018 18:23:52 INFO [driverTest]: request Fired +:<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">  <soap:Body>    <Multiply xmlns="http://tempuri.org/">      <intA>3</intA>      <intB>2</intB>    </Multiply>  </soap:Body></soap:Envelope>
10-10-2018 18:23:52 INFO [driverTest]: Response Code  :200
10-10-2018 18:23:52 INFO [driverTest]: Response Header  :Cache-Control=private, max-age=0
Content-Type=text/xml; charset=utf-8
Content-Encoding=gzip
Vary=Accept-Encoding
Server=Microsoft-IIS/7.5
X-AspNet-Version=2.0.50727
X-Powered-By=ASP.NET
Date=Wed, 10 Oct 2018 12:53:44 GMT
Content-Length=302
10-10-2018 18:23:52 INFO [driverTest]: Response   :<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><MultiplyResponse xmlns="http://tempuri.org/"><MultiplyResult>6</MultiplyResult></MultiplyResponse></soap:Body></soap:Envelope>
10-10-2018 18:24:09 INFO [driverTest]: XXXXXXXXXXXXXXXXXXXXXXX             -E---N---D-             XXXXXXXXXXXXXXXXXXXXXX
10-10-2018 18:24:09 INFO [driverTest]: ****************************************************************************************
10-10-2018 18:24:09 INFO [driverTest]: ****************************************************************************************
10-10-2018 18:24:09 INFO [driverTest]: $$$$$$$$$$$$$$$$$$$$$ TC_004 $$$$$$$$$$$$$$$$$$$$$$$$$
10-10-2018 18:24:09 INFO [driverTest]: ****************************************************************************************
10-10-2018 18:24:09 INFO [driverTest]: ****************************************************************************************
10-10-2018 18:24:10 INFO [driverTest]: request Fired +:<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">  <soap:Body>    <Subtract xmlns="http://tempuri.org/">      <intA>6</intA>      <intB>3</intB>    </Subtract>  </soap:Body></soap:Envelope>
10-10-2018 18:24:11 INFO [driverTest]: Response Code  :200
10-10-2018 18:24:11 INFO [driverTest]: Response Header  :Cache-Control=private, max-age=0
Content-Type=text/xml; charset=utf-8
Content-Encoding=gzip
Vary=Accept-Encoding
Server=Microsoft-IIS/7.5
X-AspNet-Version=2.0.50727
X-Powered-By=ASP.NET
Date=Wed, 10 Oct 2018 12:54:03 GMT
Content-Length=302
10-10-2018 18:24:11 INFO [driverTest]: Response   :<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><SubtractResponse xmlns="http://tempuri.org/"><SubtractResult>3</SubtractResult></SubtractResponse></soap:Body></soap:Envelope>
10-10-2018 18:24:26 INFO [driverTest]: XXXXXXXXXXXXXXXXXXXXXXX             -E---N---D-             XXXXXXXXXXXXXXXXXXXXXX
10-10-2018 18:24:26 INFO [driverTest]: ****************************************************************************************
10-10-2018 18:24:26 INFO [driverTest]: ****************************************************************************************
10-10-2018 18:24:26 INFO [driverTest]: $$$$$$$$$$$$$$$$$$$$$ TC_005 $$$$$$$$$$$$$$$$$$$$$$$$$
10-10-2018 18:24:26 INFO [driverTest]: ****************************************************************************************
10-10-2018 18:24:26 INFO [driverTest]: ****************************************************************************************
10-10-2018 18:24:26 INFO [driverTest]: request Fired +:<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:blz="http://thomas-bayer.com/blz/">   <soapenv:Header/>   <soapenv:Body>      <blz:getBank>         <blz:blz>10060198</blz:blz>      </blz:getBank>   </soapenv:Body></soapenv:Envelope>
10-10-2018 18:24:27 INFO [driverTest]: Response Code  :200
10-10-2018 18:24:27 INFO [driverTest]: Response Header  :Server=Apache-Coyote/1.1
Content-Type=text/xml;charset=ISO-8859-1
Date=Wed, 10 Oct 2018 12:54:33 GMT
Content-Length=400
10-10-2018 18:24:27 INFO [driverTest]: Response   :<?xml version='1.0' encoding='ISO-8859-1'?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Body><ns1:getBankResponse xmlns:ns1="http://thomas-bayer.com/blz/"><ns1:details><ns1:bezeichnung>Pax-Bank</ns1:bezeichnung><ns1:bic>GENODED1PA6</ns1:bic><ns1:ort>Berlin</ns1:ort><ns1:plz>14005</ns1:plz></ns1:details></ns1:getBankResponse></soapenv:Body></soapenv:Envelope>
10-10-2018 18:24:41 INFO [driverTest]: XXXXXXXXXXXXXXXXXXXXXXX             -E---N---D-             XXXXXXXXXXXXXXXXXXXXXX
10-10-2018 18:24:41 INFO [driverTest]: ****************************************************************************************
10-10-2018 18:24:41 INFO [driverTest]: ****************************************************************************************
10-10-2018 18:24:41 INFO [driverTest]: $$$$$$$$$$$$$$$$$$$$$ TC_006 $$$$$$$$$$$$$$$$$$$$$$$$$
10-10-2018 18:24:41 INFO [driverTest]: ****************************************************************************************
10-10-2018 18:24:41 INFO [driverTest]: ****************************************************************************************
10-10-2018 18:24:41 INFO [driverTest]: request Fired +:{    "email": "peter@klaven",    "password": "cityslicka"}
10-10-2018 18:24:43 INFO [driverTest]: Response Code  :200
10-10-2018 18:24:43 INFO [driverTest]: Response Header  :Date=Wed, 10 Oct 2018 12:54:34 GMT
Content-Type=application/json; charset=utf-8
Content-Length=28
Connection=keep-alive
Set-Cookie=__cfduid=d831e6c1da86780c32f76ab9e7f04adee1539176074; expires=Thu, 10-Oct-19 12:54:34 GMT; path=/; domain=.reqres.in; HttpOnly
X-Powered-By=Express
Access-Control-Allow-Origin=*
ETag=W/"1c-Qhb23J5gzWLVsuoGOIKOSkfy7a0"
Expect-CT=max-age=604800, report-uri="https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct"
Server=cloudflare
CF-RAY=46793c81faf6aa92-SIN
10-10-2018 18:24:43 INFO [driverTest]: Response   :{"token":"QpwL5tke4Pnpja7X"}
10-10-2018 18:25:06 INFO [driverTest]: XXXXXXXXXXXXXXXXXXXXXXX             -E---N---D-             XXXXXXXXXXXXXXXXXXXXXX
10-10-2018 18:25:06 INFO [driverTest]: ****************************************************************************************
10-10-2018 18:25:06 INFO [driverTest]: ****************************************************************************************
10-10-2018 18:25:06 INFO [driverTest]: $$$$$$$$$$$$$$$$$$$$$ TC_007 $$$$$$$$$$$$$$$$$$$$$$$$$
10-10-2018 18:25:06 INFO [driverTest]: ****************************************************************************************
10-10-2018 18:25:06 INFO [driverTest]: ****************************************************************************************
10-10-2018 18:25:06 INFO [driverTest]: request Fired +:{    "name": "Arun",    "job": "TeamLead"}
10-10-2018 18:25:06 INFO [driverTest]: Response Code  :201
10-10-2018 18:25:06 INFO [driverTest]: Response Header  :Date=Wed, 10 Oct 2018 12:54:58 GMT
Content-Type=application/json; charset=utf-8
Content-Length=82
Connection=keep-alive
Set-Cookie=__cfduid=d57aeecfb4602bab1645cee39a3b2f2e31539176098; expires=Thu, 10-Oct-19 12:54:58 GMT; path=/; domain=.reqres.in; HttpOnly
X-Powered-By=Express
Access-Control-Allow-Origin=*
ETag=W/"52-IKu0AXIerhXM4uBdbCafruHnSaU"
Expect-CT=max-age=604800, report-uri="https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct"
Server=cloudflare
CF-RAY=46793d17a98caa92-SIN
10-10-2018 18:25:06 INFO [driverTest]: Response   :{"name":"Arun","job":"TeamLead","id":"115","createdAt":"2018-10-10T12:57:30.158Z"}
10-10-2018 18:25:32 INFO [driverTest]: XXXXXXXXXXXXXXXXXXXXXXX             -E---N---D-             XXXXXXXXXXXXXXXXXXXXXX
10-10-2018 18:25:32 INFO [driverTest]: ****************************************************************************************
10-10-2018 18:25:32 INFO [driverTest]: ****************************************************************************************
10-10-2018 18:25:32 INFO [driverTest]: $$$$$$$$$$$$$$$$$$$$$ TC_008 $$$$$$$$$$$$$$$$$$$$$$$$$
10-10-2018 18:25:32 INFO [driverTest]: ****************************************************************************************
10-10-2018 18:25:32 INFO [driverTest]: ****************************************************************************************
10-10-2018 18:25:32 INFO [driverTest]: request Fired +:{    "name": "",    "job": ""}
10-10-2018 18:25:33 INFO [driverTest]: Response Code  :200
10-10-2018 18:25:33 INFO [driverTest]: Response Header  :Date=Wed, 10 Oct 2018 12:55:25 GMT
Content-Type=application/json; charset=utf-8
Transfer-Encoding=chunked
Connection=keep-alive
Set-Cookie=__cfduid=dfb420a2e047a1629f2513507ca93b30a1539176124; expires=Thu, 10-Oct-19 12:55:24 GMT; path=/; domain=.reqres.in; HttpOnly
X-Powered-By=Express
Access-Control-Allow-Origin=*
ETag=W/"1bb-wM9a6JWbwt3JpLNfwoQwxnqaC3Y"
Expect-CT=max-age=604800, report-uri="https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct"
Server=cloudflare
CF-RAY=46793dbb8c52aaa4-SIN
Content-Encoding=gzip
10-10-2018 18:25:33 INFO [driverTest]: Response   :{"page":2,"per_page":3,"total":12,"total_pages":4,"data":[{"id":4,"first_name":"Eve","last_name":"Holt","avatar":"https://s3.amazonaws.com/uifaces/faces/twitter/marcoramires/128.jpg"},{"id":5,"first_name":"Charles","last_name":"Morris","avatar":"https://s3.amazonaws.com/uifaces/faces/twitter/stephenmoon/128.jpg"},{"id":6,"first_name":"Tracey","last_name":"Ramos","avatar":"https://s3.amazonaws.com/uifaces/faces/twitter/bigmancho/128.jpg"}]}
10-10-2018 18:25:48 INFO [driverTest]: XXXXXXXXXXXXXXXXXXXXXXX             -E---N---D-             XXXXXXXXXXXXXXXXXXXXXX
10-10-2018 18:25:48 INFO [driverTest]: ****************************************************************************************
10-10-2018 18:25:48 INFO [driverTest]: ****************************************************************************************
10-10-2018 18:25:48 INFO [driverTest]: $$$$$$$$$$$$$$$$$$$$$ TC_009 $$$$$$$$$$$$$$$$$$$$$$$$$
10-10-2018 18:25:48 INFO [driverTest]: ****************************************************************************************
10-10-2018 18:25:48 INFO [driverTest]: ****************************************************************************************
10-10-2018 18:25:48 INFO [driverTest]: request Fired +:<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.dataaccess.com/webservicesserver/">   <soapenv:Header/>   <soapenv:Body>      <web:NumberToDollars>         <web:dNum>200</web:dNum>      </web:NumberToDollars>   </soapenv:Body></soapenv:Envelope>
10-10-2018 18:25:49 INFO [driverTest]: Response Code  :200
10-10-2018 18:25:49 INFO [driverTest]: Response Header  :Cache-Control=private, max-age=0
Content-Type=text/xml; charset=utf-8
Content-Encoding=gzip
Vary=Accept-Encoding
Server=Microsoft-IIS/8.0
Web-Service=DataFlex 18.1
Access-Control-Allow-Origin=http://www.dataaccess.com
Access-Control-Allow-Methods=GET, POST
Access-Control-Allow-Headers=content-type
Access-Control-Allow-Credentials=true
Strict-Transport-Security=max-age=31536000
Date=Wed, 10 Oct 2018 12:55:12 GMT
Content-Length=316
10-10-2018 18:25:49 INFO [driverTest]: Response   :<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <m:NumberToDollarsResponse xmlns:m="http://www.dataaccess.com/webservicesserver/">
      <m:NumberToDollarsResult>two hundred dollars</m:NumberToDollarsResult>
    </m:NumberToDollarsResponse>
  </soap:Body>
</soap:Envelope>
10-10-2018 18:26:07 INFO [driverTest]: XXXXXXXXXXXXXXXXXXXXXXX             -E---N---D-             XXXXXXXXXXXXXXXXXXXXXX
